In [3]:
import pandas as pd
import numpy as np
from scipy.sparse import csr_matrix

In [4]:
ratingCols = ['UserID','MovieID','Rating','Timestamp']
ratings = pd.read_csv('ml-1m/ratings.dat', sep='::', engine='python',header=None,names=ratingCols)
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [5]:
userCols = ['UserID','Gender','Age','Occupation','Zip-code']
users = pd.read_csv('ml-1m/users.dat', sep='::', engine='python',header=None,names=userCols)
users.head()

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [6]:
movieCols = ['MovieID','Title','Genres']
movies = pd.read_csv('ml-1m/movies.dat', sep='::', engine='python',header=None,names=movieCols)
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [7]:
#Starting the process to remove the lesser known movies to remove noise
merge_movie_ratings = pd.merge(ratings,movies,on='MovieID')
drop_extra_columns = ['Timestamp','Genres']
merge_movie_ratings = merge_movie_ratings.drop(drop_extra_columns,axis=1)
merge_movie_ratings.head()

   UserID  MovieID  Rating                                   Title
0       1     1193       5  One Flew Over the Cuckoo's Nest (1975)
1       2     1193       5  One Flew Over the Cuckoo's Nest (1975)
2      12     1193       4  One Flew Over the Cuckoo's Nest (1975)
3      15     1193       4  One Flew Over the Cuckoo's Nest (1975)
4      17     1193       5  One Flew Over the Cuckoo's Nest (1975)

In [21]:
merge_movie_ratings = merge_movie_ratings.dropna(axis = 0, subset=['Title'])

In [9]:
movie_ratingCount = (merge_movie_ratings.groupby(by = ['Title'])['Rating'].count().reset_index())
movie_ratingCount.head()

                           Title  Rating
0         $1,000,000 Duck (1971)      37
1           'Night Mother (1986)      70
2      'Til There Was You (1997)      52
3             'burbs, The (1989)     303
4  ...And Justice for All (1979)     199

In [10]:
#Now Renaming the columns in movie_ratingCount
#movie_ratingCount = movie_ratingCount.rename(columns={'Title':'Rating'})[['movieTitle','totalRating']]
movie_ratingCount.columns = ['Title','totalRating']
movie_ratingCount.head()

                           Title  totalRating
0         $1,000,000 Duck (1971)           37
1           'Night Mother (1986)           70
2      'Til There Was You (1997)           52
3             'burbs, The (1989)          303
4  ...And Justice for All (1979)          199

In [11]:
rating_with_totalRating = merge_movie_ratings.merge(movie_ratingCount,left_on='Title',right_on='Title',how='left')
rating_with_totalRating.head()

,UserID,MovieID,Rating,Title,totalRating
0,1,1193,5,One Flew Over the Cuckoo's Nest (1975),1725
1,2,1193,5,One Flew Over the Cuckoo's Nest (1975),1725
2,12,1193,4,One Flew Over the Cuckoo's Nest (1975),1725
3,15,1193,4,One Flew Over the Cuckoo's Nest (1975),1725
4,17,1193,5,One Flew Over the Cuckoo's Nest (1975),1725

In [22]:
#print(rating_with_totalRating)

In [13]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)
print(movie_ratingCount['totalRating'].describe())

count   3706.000
mean     269.889
std      384.048
min        1.000
25%       33.000
50%      123.500
75%      350.000
max     3428.000
Name: totalRating, dtype: float64

In [14]:
print(movie_ratingCount['totalRating'].quantile(np.arange(.9,1,.01)))

0.900    729.500
0.910    773.550
0.920    825.000
0.930    887.300
0.940    971.400
0.950   1051.500
0.960   1133.800
0.970   1268.100
0.980   1446.600
0.990   1784.900
Name: totalRating, dtype: float64

In [29]:
threshold = 100
rating_popular_movie = movie_ratingCount.query('totalRating >= @threshold')
print(rating_popular_movie)

                                                 Title  totalRating
3                                   'burbs, The (1989)          303
4                        ...And Justice for All (1979)          199
6                    10 Things I Hate About You (1999)          700
7                                101 Dalmatians (1961)          565
8                                101 Dalmatians (1996)          364
9                                  12 Angry Men (1957)          616
10                            13th Warrior, The (1999)          750
12                         2 Days in the Valley (1996)          286
13                                     20 Dates (1998)          139
14                 20,000 Leagues Under the Sea (1954)          575
15                               200 Cigarettes (1999)          181
16                        2001: A Space Odyssey (1968)         1716
17                                         2010 (1984)          470
20                                      28 Days (2000)          505
24                                39 Steps, The (1935)          253
25      400 Blows, The (Les Quatre cents coups) (1959)          187
27                                   52 Pick-Up (1986)          140
28                                           54 (1998)          259
29                    7th Voyage of Sinbad, The (1958)          258
30                                        8 1/2 (1963)          228
32                      8 Heads in a Duffel Bag (1997)          145
34                                          8MM (1999)          272
36        Abbott and Costello Meet Frankenstein (1948)          206
39                          About Last Night... (1986)          326
41                 Absent Minded Professor, The (1961)          380
42                               Absolute Power (1997)          380
43                                   Abyss, The (1989)         1715
44                   Ace Ventura: Pet Detective (1994)          766
45               Ace Ventura: When Nature Calls (1995)          389
46                         Aces: Iron Eagle III (1992)          125
...                                                ...          ...
3641   Wings of Desire (Der Himmel über Berlin) (1987)          242
3642                     Wings of the Dove, The (1997)          218
3643       Winnie the Pooh and the Blustery Day (1968)          221
3644                           Winslow Boy, The (1998)          146
3649                                 Wishmaster (1997)          128
3652                                With Honors (1994)          228
3655                                    Witness (1985)         1046
3656                          Wizard of Oz, The (1939)         1718
3657                                       Wolf (1994)          272
3658                              Wolf Man, The (1941)          134
3662  Women on the Verge of a Nervous Breakdown (1988)          353
3664                                Wonder Boys (2000)          496
3671                               Working Girl (1988)          514
3672                   World Is Not Enough, The (1999)          862
3675                        Wrong Trousers, The (1993)          882
3676                         Wrongfully Accused (1998)          123
3677                                 Wyatt Earp (1994)          270
3678             X-Files: Fight the Future, The (1998)          996
3679                                      X-Men (2000)         1511
3685                 Year of Living Dangerously (1982)          391
3687                           Yellow Submarine (1968)          399
3688                                    Yojimbo (1961)          215
3691                            You've Got Mail (1998)          838
3693                         Young Frankenstein (1974)         1193
3694                                 Young Guns (1988)          562
3695                              Young Guns II (1990)          369
3697                      Young Sherlock Holmes (1985)          379
3699                 Your Friends and Neighbors (1998)          109
3702                                Zero Effect (1998)          301
3705                                   eXistenZ (1999)          410

[2019 rows x 2 columns]

In [30]:
rating_with_totalRating_pivot = rating_with_totalRating.pivot(index='Title',columns='UserID',values='Rating').fillna(0)
rating_with_totalRating_matrix = csr_matrix(rating_with_totalRating_pivot.values)

In [31]:
#print(rating_with_totalRating_matrix)

In [32]:
from sklearn.neighbors import NearestNeighbors
model_knn = NearestNeighbors(metric='cosine',algorithm = 'brute')
model_knn.fit(rating_with_totalRating_matrix)

NearestNeighbors(algorithm='brute', leaf_size=30, metric='cosine',
         metric_params=None, n_jobs=None, n_neighbors=5, p=2, radius=1.0)

In [42]:
query_index = np.random.choice(rating_with_totalRating_pivot.shape[0])
distances, indices = model_knn.kneighbors(rating_with_totalRating_pivot.iloc[query_index, :].values.reshape(1, -1), n_neighbors = 10)

for i in range(0, len(distances.flatten())):
    if i == 0:
        print('Recommendations for {0}:\n'.format(rating_with_totalRating_pivot.index[query_index]))
    else:
        print('{0}: {1}, with distance of {2}:'.format(i, rating_with_totalRating_pivot.index[indices.flatten()[i]], distances.flatten()[i]))

Recommendations for Three Colors: Red (1994):

1: Three Colors: White (1994), with distance of 0.364471141354031:
2: Three Colors: Blue (1993), with distance of 0.3886514061722103:
3: Double Life of Veronique, The (La Double Vie de Véronique) (1991), with distance of 0.6335071894135835:
4: Sweet Hereafter, The (1997), with distance of 0.6651799138246871:
5: Secrets & Lies (1996), with distance of 0.6753978103592515:
6: Breaking the Waves (1996), with distance of 0.6811300248943519:
7: Player, The (1992), with distance of 0.6846092794299563:
8: Postino, Il (The Postman) (1994), with distance of 0.6865510871684214:
9: Raise the Red Lantern (1991), with distance of 0.6921391088751053: